# Pandas!

In [1]:
import pandas as pd

1. Series
A Series is a one-dimensional labeled array.

It can hold any data type (integers, floats, strings, etc.).

It has an index that labels each element.

Think of it as a column in an Excel sheet or a single list with labels.

## series

In [7]:
# my_series = pd.Series(data,indeex,name)

In [8]:
new_Series = pd.Series(dtype = int)

In [9]:
new_Series

Series([], dtype: int64)

In this example, we're creating an empty series using Pandas. It's like reserving a spot for data, but for now, it's empty. We're telling Pandas that we want it to be a series of whole numbers (dtype = 'int'). It's like setting up a container in advance, even though we haven't put anything in it yet. This can be useful when we plan to add data later on.

#### example

In [12]:
production_data =  [1000,1100,1200,1300,1400,1500,1600]

In [13]:
prodection_day = ['day1','day2','day3','day4','day5','day6','day7',]

In [14]:
my_series = pd.Series(data = production_data,index=prodection_day,name='production details')

In [15]:
my_series

day1    1000
day2    1100
day3    1200
day4    1300
day5    1400
day6    1500
day7    1600
Name: production details, dtype: int64

In [16]:
daily_prodection = pd.Series(data = production_data[1:],index = prodection_day,name = 'production detail')

ValueError: Length of values (6) does not match length of index (7)

In [ ]:
my_series.name

In [ ]:
my_series.index

In [ ]:
my_series.values # in here we dont use data we there values of series

In [ ]:
my_series.dtype

In [ ]:
my_series.shape

In [ ]:
my_series.ndim # dimentional of this serries

In [ ]:
len(my_series)

## DATAFRAMES

pd.DataFrame(data, index, columns, dtype)

In [ ]:
cus_data = [
    ['01','anish verma','anis@gmail.com','9818727396',50],
    ['02','harsh verma','harsh@gmail.com','9818725396',70],
    ['03','khushi verma','harsh@gmail.com','9818724396',90]
]

cus_column = [['COSTUMER ID','NAME','EMAIL','PHONE NO.','TOTAL PURCHASE']]

In [ ]:
df = pd.DataFrame(data=cus_data,columns=cus_column)

In [ ]:
df

In [ ]:
cus_index = ['A','B','C']

In [ ]:
df_ind = pd.DataFrame(data = cus_data,index = cus_index,columns =cus_column)

In [ ]:
df_ind

## Creating DataFrames from Dictionaries

In [ ]:
cus_dict = {
    'COSTUMER ID ':['A','B','C','D'],
    'NAME':['ANISH','HARSH','KHSUHI','ONI'],
    'EMAIL':['anish@gmail.com','harsh@gmail.com','khushi@gmail.com','oninoni@gmail.com'],
    'PHONE NO.':['9818727396','9818747396','9488727396','9818757396'],
    'PURCHASE':[50,20,10,40]
}

In [ ]:
new_df = pd.DataFrame(cus_dict,index = ['a','b','c','d'])

In [ ]:
new_df

## READING DATA FROM SYSTEM FILE

##### pd.read_csv(filepath_or_buffer, index_col=None, dtype=None)

Let’s look at the function in more detail:

pd.read_csv: This is a function provided by the pandas library specifically designed for reading data from CSV files.

filepath_or_buffer: This is the path or URL of the CSV file you want to read. You should replace filepath_or_buffer with the actual file path or URL.

index_col: This parameter is optional. It specifies which column(s) should be used as the index (row labels) of the resulting DataFrame. If not provided, pandas will automatically assign integer indices.

dtype: This parameter is optional. It allows you to specify the data types for the columns in the DataFrame. If not provided, pandas will infer the data types.

In [ ]:
df_read = pd.read_csv('anish.csv')

In [ ]:
df_read

In [ ]:
new_read  = pd.read_csv(filepath_or_buffer = 'anish.csv',index_col ='name' )

In [ ]:
new_read

In [ ]:
read_carprice = pd.read_csv('carprices.csv')

In [ ]:
read_carprice

In [ ]:
read_movierating = pd.read_csv('User_Movie_Ratings.csv',index_col = None) # index_col/set_index both are same

In [ ]:
read_movierating

In [ ]:
dfr = pd.read_clipboard()

In [ ]:
dfr.set_index('User')

#### head and tail

In [ ]:
read_movierating.head()

In [ ]:
read_movierating.head(3)

In [ ]:
# head show default the first 5 entry and element

In [ ]:
read_movierating.tail()

In [ ]:
read_movierating.tail(2)

In [ ]:
# tail show default last 5 entry

In [ ]:
read_carprice.axes

In [ ]:
read_carprice.index

In [ ]:
read_carprice.columns

In [ ]:
len(read_carprice)

In [ ]:
read_carprice.shape

In [ ]:
read_carprice.size

In [ ]:
read_carprice.dtypes

In [ ]:
read_carprice.info()

In [ ]:
read_carprice.keys()

In [ ]:
read_carprice.values

In [ ]:
read_movierating.transpose() # simple meaning is that it change the angle

## Accessing Data From DataFrames

### Direct Access

In [ ]:
read_carprice.carname # variable.columns

In [ ]:
read_movierating['Spiderman']

In [ ]:
read_movierating[['Annabelle','Thor']] # use double bracket

In [ ]:
read_movierating['Thor'][2] # read_movierating['column name'][index number it can be string or int]

In [ ]:
excel = pd.read_excel('room_expenditure.xlsx',index_col = 'Room')

In [ ]:
excel

In [ ]:
excel['Expenditure'][0:5]

In [ ]:
excel['Expenditure']['A5']

In [ ]:
excel[A1]

In [ ]:
excel = excel.transpose()

In [ ]:
excel

In [ ]:
excel['A1'] #Now we can use the ‘Room’ row values as column indices.

### The loc indexer (Label-based Indexing)

1. .loc[] (Label-based Indexing)
Uses labels (index names) to select rows and columns.

Includes both start and end values in slicing.

Syntax: df.loc[row_label, column_label]

The syntax for using loc is typically df.loc[row_label, column_label], where row_label and column_label are the labels of the row and column you want to access, respectively. Consider the following example.

In [ ]:
excel2 = pd.read_excel('room_expenditure.xlsx',index_col = None)

In [ ]:
excel2

In [ ]:
excel2.loc[0]

In [ ]:
excel2.loc[5,'Age']

In [ ]:
excel2.loc[:,'Age']

In [ ]:
excel2[['Age','Expenditure']]

In [ ]:
excel2.loc[0,['Age','Expenditure']]

In [ ]:
excel2.loc[1:6,['Age','Expenditure']]

In [ ]:
excel2.loc[0:5,['Age','Expenditure']]

## iloc (Integer-based Indexing)

2. .iloc[] (Integer-based Indexing)
Uses integer positions (0-based index) to select rows and columns.

Excludes the end value in slicing (like Python’s range).

Syntax: df.iloc[row_index, column_index]

In [ ]:
excel2.iloc[0]

In [ ]:
excel2.iloc[0:5,0:2]

In [ ]:
# if you  want specific row and specific column 
#use
excel2.iloc[[1,3,4,6],[0,2,4]]

In [ ]:
print(type(excel2.iloc[[1,3,4,6],[0,2,4]]))

## Conditional (boolean) indexing

In [ ]:
excel2['Expenditure']>15

In [ ]:
excel2[excel2['Expenditure']>15]

In [ ]:
excel2[[excel2['Expenditure']>15] & [excel2['Cuisine']=='Indian']]

In [ ]:
excel2[(excel2['Expenditure']>15) & (excel2['Cuisine']=='Indian')]

Using & (AND operator):

Both conditions must be inside () parentheses to avoid operator precedence issues.

In [ ]:
excel2[excel2['Cuisine'].isin(['Indian'])]

#### question

In [ ]:
cars = pd.read_csv('cars_dataset.csv',index_col = None)

In [ ]:
cars

In [ ]:
cars.carname

In [ ]:
cars['carname']

In [ ]:
cars.get('carname')

In [ ]:
cars[['carname','price']]

In [ ]:
cars.loc[:,['carname','price']]

#  Pandas Operations!

## Series operations

In [ ]:
production_data = [1000, 1200, 1100, 950, 1050, 1430, 1760]

In [ ]:
production_day = ['Day1', 'Day2', 'Day3', 'Day4', 'Day5', 'Day6', 'Day7']

In [ ]:
production = pd.Series(production_day,production_data,name = 'daily production')

In [ ]:
production

#### rename()

In [ ]:
production.rename(index = 'name is change')

In [ ]:
# another way to change the name 
production.name = 'another way to change the name'

In [ ]:
production

Let’s create a series using NumPy arrays.

In [ ]:
import numpy as np

In [ ]:
array1 = np.array(['anish','khushi','harshu','panu'])

In [ ]:
array2 = np.array([100,120,130,140])

In [ ]:
series2 = pd.Series(array1,array2,name = 'bhai bhen')

In [ ]:
print(series2)

####  Applying condition

In [ ]:
production_data = [1000, 1200, 1100, 950, 1050, 1430, 1760]

In [ ]:
production_day = ['Day1', 'Day2', 'Day3', 'Day4', 'Day5', 'Day6', 'Day7']

In [ ]:
daily_production = pd.Series(production_data,prodection_day,name = 'daily production')

In [ ]:
daily_production

In [ ]:
daily_production[daily_production>1000]

In [ ]:
daily_production[(daily_production > 1000) & (daily_production < 1500)]

In [ ]:
# another way

In [ ]:
show = (daily_production >100) & (daily_production<1500)

In [ ]:
print(daily_production[show])

## DataFrame Operations

In [ ]:
room_exp = pd.read_excel('room_expenditure.xlsx')

In [ ]:
room_exp

In [ ]:
# Converting floating point values to integers
room_exp['Expenditure'].astype(int)

In [ ]:
room_exp.dtypes

In [ ]:
newroom = room_exp.convert_dtypes()

In [ ]:
newroom.dtypes

In [ ]:
newroom['Expenditure']+100

In [ ]:
newroom

In [ ]:
newroom['Expenditure']-10

In [ ]:
newroom.loc[0:5,['Expenditure']].add(100)

In Pandas' .loc[] indexing, the end index is inclusive, unlike .iloc[], where the end index is exclusive.

The '.add()' method allows you to specify a fill_value argument. For instance, if there are NaN values, you can fill them with a value (like 0) before performing the addition. In this case, it can fill any NaN in the Age column with 0 before adding 5.

In [ ]:
newroom['Age'].add(5, fill_value=0)

Likewise, to perform subtraction we can use the sub() function as follows.

In [ ]:
newroom['Age'].sub(10)

In [ ]:
newroom['Age'].div(5)

In [ ]:
newroom['Age'].mul(100)

We can also perform inter-column operations, meaning, adding or subtracting two columns. Consider the following example.

In [ ]:
newroom['Age'] + newroom['Expenditure'] # in here twoo different column add each other

In [ ]:
newroom['Age']+room_exp['Expenditure'] # in her two different column from different files

we can perform inter-column addition between string columns.  However, the result obtained would be a dataframe object with the strings concatenated.  See the following example.

In [ ]:
newroom['Name']+newroom['Cuisine']

newroom['Full_Info'] = newroom['Name'] + ' ' + newroom['Cuisine']
print(newroom[['Full_Info']])  # Display the new column in between space  this is my experiment

In [ ]:
newroom.round()

## Statistical Operations

In [ ]:
newroom['Expenditure'].sum()

In [ ]:
newroom['Expenditure'].mean()

In [ ]:
newroom['Expenditure'].max()

In [ ]:
newroom['Expenditure'].min()

In [ ]:
newroom['Expenditure'].idxmin() #The code df['Age'].idxmin() is used in pandas to find the index of the row where the minimum value occurs in the 'Age' column.

In [ ]:
newroom['Expenditure'].idxmax()

In [ ]:
newroom.describe()

In [ ]:
newroom['Cuisine'].mode()

In [ ]:
newroom.sort_values(['Expenditure'])

In [ ]:
newroom.sort_values(['Expenditure'],ascending = False)

In [ ]:
newroom.sort_values(['Cuisine','Expenditure'],ascending=False) # sorted according string not integer here the string priroties

In [ ]:
newroom.sort_index()

In [ ]:
newroom.sort_index(ascending = False)

## Functions

In [ ]:
newroom.round()

### apply()

In [ ]:
def  first_three_number(row):
    row = row[0:3]
    return row

In [ ]:
def mean (row):
    row = row *2
    return row

In [ ]:
newroom.apply(first_three_number)

In [ ]:
newroom['Name'].apply(first_three_number)

In [ ]:
newroom['Expenditure'].apply(mean)

# Group Operations

In [ ]:
newroom.groupby(['Cuisine'])

In [ ]:
newroom.groupby(by = ['Cuisine']).mean(numeric_only = True)

In [ ]:
import numpy as np

In [ ]:
newroom.groupby(by='Cuisine')['Expenditure'].apply(np.mean)

In [ ]:
grouped_df = newroom.groupby('Cuisine')

summary_df = grouped_df.aggregate({'Expenditure': 'mean'})



print(summary_df)

## Other DataFrame Operations

### Deleting elements from dataframes

In [4]:
room3 = pd.read_excel('room_expenditure.xlsx')

In [6]:
room3

  Room      Name  Age   Cuisine  Expenditure
0   A1    Shilpa   18    Indian        24.65
1   A2  Jaspreet   32  American        18.54
2   A3   Dominic   19    Indian        27.66
3   A4     Ahmad   22  American        19.54
4   A5    Joseph   28    Indian        17.32
5   A6      Saju   31    Indian        12.56
6   A7    Monica   48   Chinese        11.09
7   A8    Preeti   67  American        12.23
8   A9      Emma   24    Indian        18.88
9  A10    Gaurav   29   Chinese        14.43

In [8]:
room3.drop(labels = 'Room' ,axis = 1,inplace = True) # inplace argument for the permanent drop

In [12]:
room3

       Name  Age   Cuisine  Expenditure
0    Shilpa   18    Indian        24.65
1  Jaspreet   32  American        18.54
2   Dominic   19    Indian        27.66
3     Ahmad   22  American        19.54
4    Joseph   28    Indian        17.32
5      Saju   31    Indian        12.56
6    Monica   48   Chinese        11.09
7    Preeti   67  American        12.23
8      Emma   24    Indian        18.88
9    Gaurav   29   Chinese        14.43

In [14]:
nwroom = room3.copy()

In [16]:
nwroom

       Name  Age   Cuisine  Expenditure
0    Shilpa   18    Indian        24.65
1  Jaspreet   32  American        18.54
2   Dominic   19    Indian        27.66
3     Ahmad   22  American        19.54
4    Joseph   28    Indian        17.32
5      Saju   31    Indian        12.56
6    Monica   48   Chinese        11.09
7    Preeti   67  American        12.23
8      Emma   24    Indian        18.88
9    Gaurav   29   Chinese        14.43

In [18]:
nwroom.drop(labels = [3,7],axis = 0,inplace = True)

In [20]:
nwroom

       Name  Age   Cuisine  Expenditure
0    Shilpa   18    Indian        24.65
1  Jaspreet   32  American        18.54
2   Dominic   19    Indian        27.66
4    Joseph   28    Indian        17.32
5      Saju   31    Indian        12.56
6    Monica   48   Chinese        11.09
8      Emma   24    Indian        18.88
9    Gaurav   29   Chinese        14.43

### Changing Elements from Dataframes

In [22]:
nwroom.loc[3,'Cuisine'] = 'Indian' # add the new entry

In [24]:
nwroom

       Name   Age   Cuisine  Expenditure
0    Shilpa  18.0    Indian        24.65
1  Jaspreet  32.0  American        18.54
2   Dominic  19.0    Indian        27.66
4    Joseph  28.0    Indian        17.32
5      Saju  31.0    Indian        12.56
6    Monica  48.0   Chinese        11.09
8      Emma  24.0    Indian        18.88
9    Gaurav  29.0   Chinese        14.43
3       NaN   NaN    Indian          NaN

In [26]:
nwroom.loc[3,['Name','Age','Expenditure']] = ['Anish',22,20.14]

In [28]:
nwroom

       Name   Age   Cuisine  Expenditure
0    Shilpa  18.0    Indian        24.65
1  Jaspreet  32.0  American        18.54
2   Dominic  19.0    Indian        27.66
4    Joseph  28.0    Indian        17.32
5      Saju  31.0    Indian        12.56
6    Monica  48.0   Chinese        11.09
8      Emma  24.0    Indian        18.88
9    Gaurav  29.0   Chinese        14.43
3     Anish  22.0    Indian        20.14

In [30]:
nwroom.loc[2:6,'Expenditure'] = 0.00

In [32]:
nwroom

       Name   Age   Cuisine  Expenditure
0    Shilpa  18.0    Indian        24.65
1  Jaspreet  32.0  American        18.54
2   Dominic  19.0    Indian         0.00
4    Joseph  28.0    Indian         0.00
5      Saju  31.0    Indian         0.00
6    Monica  48.0   Chinese         0.00
8      Emma  24.0    Indian        18.88
9    Gaurav  29.0   Chinese        14.43
3     Anish  22.0    Indian        20.14

In [34]:
nwroom['Cuisine']=nwroom['Cuisine'].replace({'Indian':'IND','American':'USA','Chinese':'CHN'})

In [36]:
nwroom

       Name   Age Cuisine  Expenditure
0    Shilpa  18.0     IND        24.65
1  Jaspreet  32.0     USA        18.54
2   Dominic  19.0     IND         0.00
4    Joseph  28.0     IND         0.00
5      Saju  31.0     IND         0.00
6    Monica  48.0     CHN         0.00
8      Emma  24.0     IND        18.88
9    Gaurav  29.0     CHN        14.43
3     Anish  22.0     IND        20.14

In [60]:
nwroom

       Name   Age Cuisine  Expenditure
0    Shilpa  18.0     IND        24.65
1  Jaspreet  32.0     USA        18.54
2   Dominic  19.0     IND         0.00
4    Joseph  28.0     IND         0.00
5      Saju  31.0     IND         0.00
6    Monica  48.0     CHN         0.00
8      Emma  24.0     IND        18.88
9    Gaurav  29.0     CHN        14.43
3     Anish  22.0     IND        20.14

In [46]:
df = pd.DataFrame(nwroom)

# drop with this sign    =     ~

In [54]:
df['Cuisine'].value_counts()

Cuisine
IND    6
CHN    2
USA    1
Name: count, dtype: int64

In [56]:
df = df[~df['Cuisine'].isin(['USA'])]

In [58]:
df

      Name   Age Cuisine  Expenditure
0   Shilpa  18.0     IND        24.65
2  Dominic  19.0     IND         0.00
4   Joseph  28.0     IND         0.00
5     Saju  31.0     IND         0.00
6   Monica  48.0     CHN         0.00
8     Emma  24.0     IND        18.88
9   Gaurav  29.0     CHN        14.43
3    Anish  22.0     IND        20.14

# Adding New Rows and Columns to Dataframes

#### Creating a new column

In [248]:
import numpy as np

In [254]:
#new_col = pd.Series(data = np.arange(0, len(nwroom), 1), name = 'NewColumn')

In [314]:
#pd.concat(objs = [nwroom, new_col], axis = 1) # this both two code is by upgrade

#### now this is my experement to add a new columns

In [349]:
nwroom['Sales'] = [10, 20, 30, 40, 50,60,70,80,90]

In [351]:
nwroom

       Name   Age Cuisine  Expenditure  Sales
0    Shilpa  18.0     IND        24.65     10
1  Jaspreet  32.0     USA        18.54     20
2   Dominic  19.0     IND         0.00     30
4    Joseph  28.0     IND         0.00     40
5      Saju  31.0     IND         0.00     50
6    Monica  48.0     CHN         0.00     60
8      Emma  24.0     IND        18.88     70
9    Gaurav  29.0     CHN        14.43     80
3     Anish  22.0     IND        20.14     90

In [356]:
# nwroom.loc[len(nwroom)] = ['Atharva', 25, 'Italian', 64.34, 87, 118.7234, 1] code from upgrad but not working

# Renaming Rows and Columns

In [359]:
room4 = pd.read_excel('room_expenditure.xlsx')

In [362]:
room4

  Room      Name  Age   Cuisine  Expenditure
0   A1    Shilpa   18    Indian        24.65
1   A2  Jaspreet   32  American        18.54
2   A3   Dominic   19    Indian        27.66
3   A4     Ahmad   22  American        19.54
4   A5    Joseph   28    Indian        17.32
5   A6      Saju   31    Indian        12.56
6   A7    Monica   48   Chinese        11.09
7   A8    Preeti   67  American        12.23
8   A9      Emma   24    Indian        18.88
9  A10    Gaurav   29   Chinese        14.43

In [374]:
room4.rename(index = {
    0:'ZERO',
    1:'ONE',
    2:'TWO',
    3:'THREE',
    4:'FOUR',
    5:'FIVE',
    6:'SIX',
    7:'SEVEN',
    8:'EIGHT',
    9:'NINE',
},inplace = True)

In [376]:
room4

      Room      Name  Age   Cuisine  Expenditure
ZERO    A1    Shilpa   18    Indian        24.65
ONE     A2  Jaspreet   32  American        18.54
TWO     A3   Dominic   19    Indian        27.66
THREE   A4     Ahmad   22  American        19.54
FOUR    A5    Joseph   28    Indian        17.32
FIVE    A6      Saju   31    Indian        12.56
SIX     A7    Monica   48   Chinese        11.09
SEVEN   A8    Preeti   67  American        12.23
EIGHT   A9      Emma   24    Indian        18.88
NINE   A10    Gaurav   29   Chinese        14.43


# concatinate and join and merge

In [381]:
#do this from rhaul sir classes